Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes.InsidePartHorizontalOrWithLeaderLinePlacingType Method
 The object is placed using the base line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line. The base line used is in the middle of the part, aligned with the part. In addition the object will be rotated to be horizontal in the drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase InsidePartHorizontalOrWithLeaderLinePlacingType()
Public Shared Function InsidePartHorizontalOrWithLeaderLinePlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new inside part horizontal or with leader line placing type instance.
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace